[Killed] ConditionalExpression
main/components/Nav/AppNavbar.tsx:56:16
                   <Nav.Link href="/h2-console">H2Console</Nav.Link>
                 </>
               )}
-              {hasRole(currentUser, "ROLE_ADMIN") && (
-                <NavDropdown
-                  title="Admin"
-                  id="appnavbar-admin-dropdown"
-                  data-testid="appnavbar-admin-dropdown"
-                >
-                  <NavDropdown.Item as={Link} to="/admin/admins">
-                    Admins
-                  </NavDropdown.Item>
-                  <NavDropdown.Item as={Link} to="/admin/hostmanagers">
-                    Host Managers
-                  </NavDropdown.Item>
-                  <NavDropdown.Item as={Link} to="/admin/developer">
-                    Developer Info
-                  </NavDropdown.Item>
-                </NavDropdown>
-              )}
+              {true}
             </Nav>
             <Nav className="ml-auto">
killedBy: AppNavbar tests renders Admin menu for admins
statusReason: Unable to find an element with the text: Admin. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-sm navbar-light bg-warning sticky-top"
      data-testid="AppNavbarLocalhost"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.tsx:56:16
                   <Nav.Link href="/h2-console">H2Console</Nav.Link>
                 </>
               )}
-              {hasRole(currentUser, "ROLE_ADMIN") && (
-                <NavDropdown
-                  title="Admin"
-                  id="appnavbar-admin-dropdown"
-                  data-testid="appnavbar-admin-dropdown"
-                >
-                  <NavDropdown.Item as={Link} to="/admin/admins">
-                    Admins
-                  </NavDropdown.Item>
-                  <NavDropdown.Item as={Link} to="/admin/hostmanagers">
-                    Host Managers
-                  </NavDropdown.Item>
-                  <NavDropdown.Item as={Link} to="/admin/developer">
-                    Developer Info
-                  </NavDropdown.Item>
-                </NavDropdown>
-              )}
+              {false}
             </Nav>
             <Nav className="ml-auto">
killedBy: AppNavbar tests renders Admin menu for admins
statusReason: Unable to find an element with the text: Admin. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-sm navbar-light bg-warning sticky-top"
      data-testid="AppNavbarLocalhost"
