[Killed] BlockStatement
main/pages/Home/HomePageLoggedOut.jsx:5:45
 
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 import LoginScreen from "main/components/Auth/LoginScreen";
-export default function HomePageLoggedOut() {
-  return (
-    <BasicLayout>
-      <LoginScreen />
-    </BasicLayout>
-  );
-}
+export default function HomePageLoggedOut() {}
 
killedBy: HomePageLoggedOut tests renders without crashing
statusReason: Unable to find an element with the text: /Welcome to the Dining Caching Proxy/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
