[Killed] BlockStatement
main/components/Nav/AppBrand.tsx:1:36
-export default function AppBrand() {
-  return (
-    <div
-      style={{
-        fontFamily: "Helvetica, Arial, sans-serif",
-        fontWeight: 800,
-        fontSize: 20,
-        color: "#1E293B",
-        background: "#d9f9ff",
-        padding: "4px 12px",
-        borderRadius: 8,
-        borderTop: "1.5px solid #1E293B",
-        borderLeft: "1.5px solid #1E293B",
-        borderRight: "4px solid #1E293B",
-        borderBottom: "4px solid #1E293B",
-      }}
-    >
-      Dining Caching Proxy
-    </div>
-  );
-}
+export default function AppBrand() {}
 
killedBy: AppNavbar tests renders the app brand link
statusReason: Unable to find an element with the text: Dining Caching Proxy. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-sm navbar-light bg-warning sticky-top"
      data-testid="AppNavbarLocalho

[Timeout] StringLiteral
main/components/Nav/AppBrand.tsx:8:16
         fontFamily: "Helvetica, Arial, sans-serif",
         fontWeight: 800,
         fontSize: 20,
-        color: "#1E293B",
+        color: "",
         background: "#d9f9ff",
         padding: "4px 12px",

[Timeout] StringLiteral
main/components/Nav/AppBrand.tsx:12:20
         background: "#d9f9ff",
         padding: "4px 12px",
         borderRadius: 8,
-        borderTop: "1.5px solid #1E293B",
+        borderTop: "",
         borderLeft: "1.5px solid #1E293B",
         borderRight: "4px solid #1E293B",
