[Killed] BooleanLiteral
main/pages/Admin/HostManagersCreatePage.tsx:15:15
 };
 
 export default function HostManagersCreatePage({
-  storybook = false,
+  storybook = true,
 }: HostManagersCreatePageProps): React.JSX.Element {
   const navigation = useNavigate();
killedBy: HostManagersCreatePage tests on submit, makes request to backend, and redirects to /admin/hostmanagers
statusReason: expected "vi.fn()" to be called with arguments: [ '/admin/hostmanagers' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ArrowFunction
main/pages/Admin/HostManagersCreatePage.tsx:18:31
   storybook = false,
 }: HostManagersCreatePageProps): React.JSX.Element {
   const navigation = useNavigate();
-  const objectToAxiosParams = (
-    hostManager: RoleEmailFormFields,
-  ): AxiosRequestConfig => ({
-    url: "/api/admin/hostmanagers/post",
-    method: "POST",
-    params: {
-      email: hostManager.email,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (hostManager: RoleEmailFormFields) => {
killedBy: HostManagersCreatePage tests on submit, makes request to backend, and redirects to /admin/hostmanagers
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
main/pages/Admin/HostManagersCreatePage.tsx:21:10
   const objectToAxiosParams = (
     hostManager: RoleEmailFormFields,
   ): AxiosRequestConfig => ({
-    url: "/api/admin/hostmanagers/post",
+    url: "",
     method: "POST",
     params: {
killedBy: HostManagersCreatePage tests on submit, makes request to backend, and redirects to /admin/hostmanagers
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "New host manager added - email: testemailone@ucsb.edu",

[Killed] ObjectLiteral
main/pages/Admin/HostManagersCreatePage.tsx:23:13
   ): AxiosRequestConfig => ({
     url: "/api/admin/hostmanagers/post",
     method: "POST",
-    params: {
-      email: hostManager.email,
-    },
+    params: {},
   });
 
killedBy: HostManagersCreatePage tests on submit, makes request to backend, and redirects to /admin/hostmanagers
statusReason: expected {} to deeply equal { email: 'testemailone@ucsb.edu' }

[Killed] BlockStatement
main/pages/Admin/HostManagersCreatePage.tsx:28:59
     },
   });
 
-  const onSuccess = (hostManager: RoleEmailFormFields) => {
-    toast(`New host manager added - email: ${hostManager.email}`);
-    if (!storybook) navigation("/admin/hostmanagers");
-  };
+  const onSuccess = (hostManager: RoleEmailFormFields) => {};
 
   const mutation = useBackendMutation(
killedBy: HostManagersCreatePage tests on submit, makes request to backend, and redirects to /admin/hostmanagers
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] ConditionalExpression
main/pages/Admin/HostManagersCreatePage.tsx:30:9
 
   const onSuccess = (hostManager: RoleEmailFormFields) => {
     toast(`New host manager added - email: ${hostManager.email}`);
-    if (!storybook) navigation("/admin/hostmanagers");
+    if (false) navigation("/admin/hostmanagers");
   };
 
killedBy: HostManagersCreatePage tests on submit, makes request to backend, and redirects to /admin/hostmanagers
statusReason: expected "vi.fn()" to be called with arguments: [ '/admin/hostmanagers' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BooleanLiteral
main/pages/Admin/HostManagersCreatePage.tsx:30:9
 
   const onSuccess = (hostManager: RoleEmailFormFields) => {
     toast(`New host manager added - email: ${hostManager.email}`);
-    if (!storybook) navigation("/admin/hostmanagers");
+    if (storybook) navigation("/admin/hostmanagers");
   };
 
killedBy: HostManagersCreatePage tests on submit, makes request to backend, and redirects to /admin/hostmanagers
statusReason: expected "vi.fn()" to be called with arguments: [ '/admin/hostmanagers' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ArrayDeclaration
main/pages/Admin/HostManagersCreatePage.tsx:36:5
   const mutation = useBackendMutation(
     objectToAxiosParams,
     { onSuccess },
-    ["/api/admin/hostmanagers/all"], // mutation makes this key stale so that pages relying on it reload
+    [], // mutation makes this key stale so that pages relying on it reload
   );
 
killedBy: HostManagersCreatePage tests useBackendMutation is called with correct cache query key
statusReason: expected "useBackendMutation" to be called with arguments: [ Any<Function>, …(2) ]

Received:

  1st useBackendMutation call:

  [
-   Any<Function>,
