[Killed] StringLiteral
main/pages/Admin/HostManagersIndexPage.tsx:11:15
 export default function HostManagersIndexPage(): React.JSX.Element {
   const { data: hostManagers } = useBackend<RoleEmail[]>(
     ["/api/admin/hostmanagers/all"],
-    { method: "GET", url: "/api/admin/hostmanagers/all" },
+    { method: "", url: "/api/admin/hostmanagers/all" },
     // Stryker disable next-line all : don't test default value of empty list
     [],
killedBy: HostManagersIndexPage tests renders empty table when backend unavailable
statusReason: expected 'Error communicating with backend via …' to match 'Error communicating with backend via …'

[Killed] ObjectLiteral
main/pages/Admin/HostManagersIndexPage.tsx:11:5
 export default function HostManagersIndexPage(): React.JSX.Element {
   const { data: hostManagers } = useBackend<RoleEmail[]>(
     ["/api/admin/hostmanagers/all"],
-    { method: "GET", url: "/api/admin/hostmanagers/all" },
+    {},
     // Stryker disable next-line all : don't test default value of empty list
     [],
killedBy: HostManagersIndexPage tests renders three items correctly
statusReason: Unable to find an element by: [data-testid="HostManagersIndexPage-cell-row-0-col-email"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] BlockStatement
main/pages/Admin/HostManagersIndexPage.tsx:16:30
     [],
   );
 
-  const createButton = () => {
-    return (
-      <Link
-        className="btn btn-primary"
-        to="/admin/hostmanagers/create"
-        style={{ float: "right" }}
-      >
-        New Host Manager
-      </Link>
-    );
-  };
+  const createButton = () => {};
 
   return (
killedBy: HostManagersIndexPage tests Renders with New Host Manager Button
statusReason: Unable to find an element with the text: /New Host Manager/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] ObjectLiteral
main/pages/Admin/HostManagersIndexPage.tsx:21:16
       <Link
         className="btn btn-primary"
         to="/admin/hostmanagers/create"
-        style={{ float: "right" }}
+        style={{}}
       >
         New Host Manager
killedBy: HostManagersIndexPage tests Renders with New Host Manager Button
statusReason: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null

[Killed] StringLiteral
main/pages/Admin/HostManagersIndexPage.tsx:21:25
       <Link
         className="btn btn-primary"
         to="/admin/hostmanagers/create"
-        style={{ float: "right" }}
+        style={{ float: "" }}
       >
         New Host Manager
killedBy: HostManagersIndexPage tests Renders with New Host Manager Button
statusReason: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null

[Killed] LogicalOperator
main/pages/Admin/HostManagersIndexPage.tsx:34:17
         {createButton()}
         <h1>Host Managers</h1>
         <RoleEmailTable
-          data={hostManagers ?? []}
+          data={hostManagers && []}
           deleteEndpoint="/api/admin/hostmanagers/delete"
           getEndpoint="/api/admin/hostmanagers/all"
killedBy: HostManagersIndexPage tests renders three items correctly
statusReason: Unable to find an element by: [data-testid="HostManagersIndexPage-cell-row-0-col-email"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[NoCoverage] ArrayDeclaration
main/pages/Admin/HostManagersIndexPage.tsx:34:33
         {createButton()}
         <h1>Host Managers</h1>
         <RoleEmailTable
-          data={hostManagers ?? []}
+          data={hostManagers ?? ["Stryker was here"]}
           deleteEndpoint="/api/admin/hostmanagers/delete"
           getEndpoint="/api/admin/hostmanagers/all"
