[Killed] StringLiteral
main/pages/Home/HomePage.tsx:28:23
   count: number;
 };
 
-const hostsEndpoint = "/api/admin/hosts";
+const hostsEndpoint = "";
 
 // A host that hasn't (yet, or successfully) resolved to a hostname still displays as its own
killedBy: HomePage tests regular users do not see the requesting-hosts table
statusReason: expected "useBackend" to be called with arguments: [ [ '/api/admin/hosts' ], …(4) ]

Received:

  1st useBackend call:

  [
    [

[Killed] ArrowFunction
main/pages/Home/HomePage.tsx:32:28
 
 // A host that hasn't (yet, or successfully) resolved to a hostname still displays as its own
 // raw IPv4 address - that's exactly the signal to show a retry button for it.
-const looksLikeIpAddress = (host: string): boolean =>
-  /^\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3}$/.test(host);
+const looksLikeIpAddress = () => undefined;
 
 export default function HomePage(): React.JSX.Element {
killedBy: HomePage tests admins see the requesting-hosts table, with a retry button only for unresolved hosts
statusReason: Unable to find an element by: [data-testid="HomePage-hosts-table-cell-row-1-col-retry-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] Regex
main/pages/Home/HomePage.tsx:33:3
 // A host that hasn't (yet, or successfully) resolved to a hostname still displays as its own
 // raw IPv4 address - that's exactly the signal to show a retry button for it.
 const looksLikeIpAddress = (host: string): boolean =>
-  /^\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3}$/.test(host);
+  /^\d{1,3}\.\d\.\d{1,3}\.\d{1,3}$/.test(host);
 
 export default function HomePage(): React.JSX.Element {
killedBy: HomePage tests admins see the requesting-hosts table, with a retry button only for unresolved hosts
statusReason: Unable to find an element by: [data-testid="HomePage-hosts-table-cell-row-1-col-retry-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] Regex
main/pages/Home/HomePage.tsx:33:3
 // A host that hasn't (yet, or successfully) resolved to a hostname still displays as its own
 // raw IPv4 address - that's exactly the signal to show a retry button for it.
 const looksLikeIpAddress = (host: string): boolean =>
-  /^\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3}$/.test(host);
+  /^\d\.\d{1,3}\.\d{1,3}\.\d{1,3}$/.test(host);
 
 export default function HomePage(): React.JSX.Element {
killedBy: HomePage tests admins see the requesting-hosts table, with a retry button only for unresolved hosts
statusReason: Unable to find an element by: [data-testid="HomePage-hosts-table-cell-row-1-col-retry-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] ArrayDeclaration
main/pages/Home/HomePage.tsx:37:5
 
 export default function HomePage(): React.JSX.Element {
   const { data } = useBackend<Stats>(
-    ["/api/stats"],
+    [],
     { method: "GET", url: "/api/stats" },
     // Stryker disable next-line all : don't test default value of empty stats
killedBy: HomePage tests useBackend is called with the correct cache query key
statusReason: expected "useBackend" to be called with arguments: [ [ '/api/stats' ], …(2) ]

Received:

  1st useBackend call:

@@ -1,9 +1,7 @@
  [

[Killed] StringLiteral
main/pages/Home/HomePage.tsx:38:15
 export default function HomePage(): React.JSX.Element {
   const { data } = useBackend<Stats>(
     ["/api/stats"],
-    { method: "GET", url: "/api/stats" },
+    { method: "", url: "/api/stats" },
     // Stryker disable next-line all : don't test default value of empty stats
     defaultStats,
killedBy: HomePage tests useBackend is called with the correct cache query key
statusReason: expected "useBackend" to be called with arguments: [ [ '/api/stats' ], …(2) ]

Received:

  1st useBackend call:

@@ -1,11 +1,11 @@
  [

[Killed] LogicalOperator
main/pages/Home/HomePage.tsx:42:17
     // Stryker disable next-line all : don't test default value of empty stats
     defaultStats,
   );
-  const stats = data ?? defaultStats;
+  const stats = data && defaultStats;
 
   const currentUser = useCurrentUser();
killedBy: HomePage tests renders the four stats from the backend
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  10
Received:
  0

Ignored nodes: comments, script, style

[Killed] StringLiteral
main/pages/Home/HomePage.tsx:45:40
   const stats = data ?? defaultStats;
 
   const currentUser = useCurrentUser();
-  const isAdmin = hasRole(currentUser, "ROLE_ADMIN");
+  const isAdmin = hasRole(currentUser, "");
 
   const { data: hostCounts } = useBackend<HostCount[]>(
killedBy: HomePage tests a failed hosts fetch surfaces an error the same as any other useBackend call
statusReason: expected 0 to be greater than or equal to 1

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ArrowFunction
main/pages/Home/HomePage.tsx:60:5
   );
 
   const retryMutation = useBackendMutation<string>(
-    (ip: string) => ({
-      url: `${hostsEndpoint}/resolve`,
-      method: "POST",
-      params: { ip },
-    }),
+    () => undefined,
     {
       onSuccess: () => {
killedBy: HomePage tests clicking retry posts to the resolve endpoint for that IP
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
main/pages/Home/HomePage.tsx:62:15
   const retryMutation = useBackendMutation<string>(
     (ip: string) => ({
       url: `${hostsEndpoint}/resolve`,
-      method: "POST",
+      method: "",
       params: { ip },
     }),
killedBy: HomePage tests clicking retry posts to the resolve endpoint for that IP
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
main/pages/Home/HomePage.tsx:63:15
     (ip: string) => ({
       url: `${hostsEndpoint}/resolve`,
       method: "POST",
-      params: { ip },
+      params: {},
     }),
     {
killedBy: HomePage tests clicking retry posts to the resolve endpoint for that IP
statusReason: expected {} to deeply equal { ip: '203.0.113.5' }

[Killed] ObjectLiteral
main/pages/Home/HomePage.tsx:65:5
       method: "POST",
       params: { ip },
     }),
-    {
-      onSuccess: () => {
-        toast("Requested hostname resolution");
-      },
-    },
+    {},
     // Stryker disable next-line ArrayDeclaration: invalidateQueries([]) invalidates every
     // query, which is behaviorally identical here since this is the only active query.
killedBy: HomePage tests clicking retry posts to the resolve endpoint for that IP
statusReason: expected "vi.fn()" to be called with arguments: [ 'Requested hostname resolution' ]

Received:

  1st vi.fn() call:

  [
-   "Requested hostname resolution",

[Killed] BlockStatement
main/pages/Home/HomePage.tsx:66:24
       params: { ip },
     }),
     {
-      onSuccess: () => {
-        toast("Requested hostname resolution");
-      },
+      onSuccess: () => {},
     },
     // Stryker disable next-line ArrayDeclaration: invalidateQueries([]) invalidates every
killedBy: HomePage tests clicking retry posts to the resolve endpoint for that IP
statusReason: expected "vi.fn()" to be called with arguments: [ 'Requested hostname resolution' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/pages/Home/HomePage.tsx:67:15
     }),
     {
       onSuccess: () => {
-        toast("Requested hostname resolution");
+        toast("");
       },
     },
killedBy: HomePage tests clicking retry posts to the resolve endpoint for that IP
statusReason: expected "vi.fn()" to be called with arguments: [ 'Requested hostname resolution' ]

Received:

  1st vi.fn() call:

  [
-   "Requested hostname resolution",

[Killed] ArrayDeclaration
main/pages/Home/HomePage.tsx:75:23
     [hostsEndpoint],
   );
 
-  const hostColumns = [
-    { header: "Host", accessorKey: "host" },
-    { header: "Count", accessorKey: "count" },
-    {
-      header: "",
-      id: "retry",
-      cell: ({ cell }: { cell: Cell<HostCount, unknown> }) => {
-        if (!looksLikeIpAddress(cell.row.original.host)) {
-          return null;
-        }
-        return (
-          <Button
-            size="sm"
-            onClick={() => retryMutation.mutate(cell.row.original.host)}
-            data-testid={`HomePage-hosts-table-cell-row-${cell.row.index}-col-retry-button`}
-          >
-            Retry
-          </Button>
-        );
-      },
-    },
-  ];
+  const hostColumns = [];
 
   return (
killedBy: HomePage tests admins see the requesting-hosts table, with a retry button only for unresolved hosts
statusReason: Unable to find an element by: [data-testid="HomePage-hosts-table-cell-row-0-col-host"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] StringLiteral
main/pages/Home/HomePage.tsx:77:15
 
   const hostColumns = [
     { header: "Host", accessorKey: "host" },
-    { header: "Count", accessorKey: "count" },
+    { header: "", accessorKey: "count" },
     {
       header: "",
killedBy: HomePage tests admins see the requesting-hosts table, with a retry button only for unresolved hosts
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Count
Received:

[Killed] BlockStatement
main/pages/Home/HomePage.tsx:81:63
     {
       header: "",
       id: "retry",
-      cell: ({ cell }: { cell: Cell<HostCount, unknown> }) => {
-        if (!looksLikeIpAddress(cell.row.original.host)) {
-          return null;
-        }
-        return (
-          <Button
-            size="sm"
-            onClick={() => retryMutation.mutate(cell.row.original.host)}
-            data-testid={`HomePage-hosts-table-cell-row-${cell.row.index}-col-retry-button`}
-          >
-            Retry
-          </Button>
-        );
-      },
+      cell: ({ cell }: { cell: Cell<HostCount, unknown> }) => {},
     },
   ];
killedBy: HomePage tests admins see the requesting-hosts table, with a retry button only for unresolved hosts
statusReason: Unable to find an element by: [data-testid="HomePage-hosts-table-cell-row-1-col-retry-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] ConditionalExpression
main/pages/Home/HomePage.tsx:82:13
       header: "",
       id: "retry",
       cell: ({ cell }: { cell: Cell<HostCount, unknown> }) => {
-        if (!looksLikeIpAddress(cell.row.original.host)) {
+        if (true) {
           return null;
         }
killedBy: HomePage tests admins see the requesting-hosts table, with a retry button only for unresolved hosts
statusReason: Unable to find an element by: [data-testid="HomePage-hosts-table-cell-row-1-col-retry-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] ConditionalExpression
main/pages/Home/HomePage.tsx:82:13
       header: "",
       id: "retry",
       cell: ({ cell }: { cell: Cell<HostCount, unknown> }) => {
-        if (!looksLikeIpAddress(cell.row.original.host)) {
+        if (false) {
           return null;
         }
killedBy: HomePage tests admins see the requesting-hosts table, with a retry button only for unresolved hosts
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  class="btn btn-primary btn-sm"
  data-testid="HomePage-hosts-table-cell-row-0-col-retry-button"
  type="button"
>
  Retry

[Killed] ArrowFunction
main/pages/Home/HomePage.tsx:88:22
         return (
           <Button
             size="sm"
-            onClick={() => retryMutation.mutate(cell.row.original.host)}
+            onClick={() => undefined}
             data-testid={`HomePage-hosts-table-cell-row-${cell.row.index}-col-retry-button`}
           >
killedBy: HomePage tests clicking retry posts to the resolve endpoint for that IP
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ConditionalExpression
main/pages/Home/HomePage.tsx:127:10
           </tbody>
         </table>
 
-        {isAdmin && (
-          <>
-            <h2>Requesting Hosts</h2>
-            <OurTable
-              // Stryker disable next-line ArrayDeclaration: initialData=[] above guarantees
-              // hostCounts is never actually undefined at runtime; this is TypeScript-only
-              // defensiveness (the useBackend generic wrapper defeats initialData narrowing).
-              data={hostCounts ?? []}
-              columns={hostColumns}
-              testid="HomePage-hosts-table"
-            />
-          </>
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: HomePage tests admins see the requesting-hosts table, with a retry button only for unresolved hosts
statusReason: Unable to find an element by: [data-testid="HomePage-hosts-table-cell-row-0-col-host"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] ConditionalExpression
main/pages/Home/HomePage.tsx:127:10
           </tbody>
         </table>
 
-        {isAdmin && (
-          <>
-            <h2>Requesting Hosts</h2>
-            <OurTable
-              // Stryker disable next-line ArrayDeclaration: initialData=[] above guarantees
-              // hostCounts is never actually undefined at runtime; this is TypeScript-only
-              // defensiveness (the useBackend generic wrapper defeats initialData narrowing).
-              data={hostCounts ?? []}
-              columns={hostColumns}
-              testid="HomePage-hosts-table"
-            />
-          </>
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: HomePage tests admins see the requesting-hosts table, with a retry button only for unresolved hosts
statusReason: Unable to find an element by: [data-testid="HomePage-hosts-table-cell-row-0-col-host"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] LogicalOperator
main/pages/Home/HomePage.tsx:134:21
               // Stryker disable next-line ArrayDeclaration: initialData=[] above guarantees
               // hostCounts is never actually undefined at runtime; this is TypeScript-only
               // defensiveness (the useBackend generic wrapper defeats initialData narrowing).
-              data={hostCounts ?? []}
+              data={hostCounts && []}
               columns={hostColumns}
               testid="HomePage-hosts-table"
killedBy: HomePage tests admins see the requesting-hosts table, with a retry button only for unresolved hosts
statusReason: Unable to find an element by: [data-testid="HomePage-hosts-table-cell-row-0-col-host"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"
