[Killed] BlockStatement
src/main/pages/UserProfilePage.tsx:7:49
 const testIdPrefix = "UserProfilePage";
 
 // Roles come back from the backend as e.g. "ROLE_ADMIN"; display them as "admin".
-function friendlyRoleName(role: string): string {
-  return role.replace(/^ROLE_/, "").toLowerCase();
-}
+function friendlyRoleName(role: string): string {}
 
 export default function UserProfilePage(): React.JSX.Element {
killedBy: UserProfilePage tests renders name, email, and roles for a regular user
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  user
Received:

[Killed] MethodExpression
src/main/pages/UserProfilePage.tsx:8:10
 
 // Roles come back from the backend as e.g. "ROLE_ADMIN"; display them as "admin".
 function friendlyRoleName(role: string): string {
-  return role.replace(/^ROLE_/, "").toLowerCase();
+  return role.replace(/^ROLE_/, "").toUpperCase();
 }
 
killedBy: UserProfilePage tests renders name, email, and roles for a regular user
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  user
Received:
  USER

[Killed] StringLiteral
src/main/pages/UserProfilePage.tsx:8:33
 
 // Roles come back from the backend as e.g. "ROLE_ADMIN"; display them as "admin".
 function friendlyRoleName(role: string): string {
-  return role.replace(/^ROLE_/, "").toLowerCase();
+  return role.replace(/^ROLE_/, "Stryker was here!").toLowerCase();
 }
 
killedBy: UserProfilePage tests renders roles for an admin/hostmanager user
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  user, admin, hostmanager
Received:
  stryker was here!user, stryker was here!admin, stryker was here!hostmanager

[Killed] BlockStatement
src/main/pages/UserProfilePage.tsx:14:30
 export default function UserProfilePage(): React.JSX.Element {
   const currentUser = useCurrentUser();
 
-  if (!currentUser.loggedIn) {
-    return <BasicLayout>Loading...</BasicLayout>;
-  }
+  if (!currentUser.loggedIn) {}
 
   const { user, rolesList } = currentUser.root;
killedBy: UserProfilePage tests renders name, email, and roles for a regular user
statusReason: Cannot destructure property 'user' of 'currentUser.root' as it is null.

[Survived] StringLiteral
src/main/pages/UserProfilePage.tsx:24:67
     <BasicLayout>
       <div className="pt-2">
         <h1 data-testid={`${testIdPrefix}-title`}>User Profile</h1>
-        <table className="table table-striped" style={{ maxWidth: "600px" }}>
+        <table className="table table-striped" style={{ maxWidth: "" }}>
           <tbody>
             <tr>

[Killed] LogicalOperator
src/main/pages/UserProfilePage.tsx:29:18
             <tr>
               <th>Name</th>
               <td data-testid={`${testIdPrefix}-name`}>
-                {user.fullName ?? "Not specified"}
+                {user.fullName && "Not specified"}
               </td>
             </tr>
killedBy: UserProfilePage tests renders name, email, and roles for a regular user
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Chris Gaucho
Received:
  Not specified

[Killed] StringLiteral
src/main/pages/UserProfilePage.tsx:38:32
             </tr>
             <tr>
               <th>Roles</th>
-              <td data-testid={`${testIdPrefix}-roles`}>
+              <td data-testid={``}>
                 {rolesList.map(friendlyRoleName).join(", ")}
               </td>
killedBy: UserProfilePage tests renders name, email, and roles for a regular user
statusReason: Unable to find an element by: [data-testid="UserProfilePage-roles"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"
