[Killed] StringLiteral
main/pages/Home/HomePage.tsx:21:27
 export default function HomePage(): React.JSX.Element {
   const { data } = useBackend<Stats>(
     ["/api/stats"],
-    { method: "GET", url: "/api/stats" },
+    { method: "GET", url: "" },
     // Stryker disable next-line all : don't test default value of empty stats
     defaultStats,
killedBy: HomePage tests renders the four stats from the backend
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  10
Received:
  0

Ignored nodes: comments, script, style
